Model: "sequential_7"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 Hidden_Layer_1 (Dense)      (None, 512)               2253312   
                                                                 
 dropout_1 (Dropout)         (None, 512)               0         
                                                                 
 Hidden_Layer_2 (Dense)      (None, 256)               131328    
                                                                 
 dropout_2 (Dropout)         (None, 256)               0         
                                                                 
 Hidden_Layer_3 (Dense)      (None, 128)               32896     
                                                                 
 dropout_3 (Dropout)         (None, 128)               0         
                                                                 
 Output_Layer (Dense)        (None, 10)                1290      
                                                                 
=================================================================
Total params: 2418826 (9.23 MB)
Trainable params: 2418826 (9.23 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________


Test Accuracy: 93.32%

CM
[[1982,    0,    0,    3,    0,    0,    2,   12,    1,    0],
[   0, 1977,   16,    0,    0,    0,    0,    0,    0,    7],
[   0,  121, 1875,    0,    0,    0,    0,    0,    0,    4],
[  22,    0,    0, 1929,   17,   25,    0,    7,    0,    0],
[  28,    0,    0,   64, 1854,   51,    1,    0,    2,    0],
[  17,    0,    0,   58,   37, 1837,   50,    1,    0,    0],
[  15,    0,    0,   12,    0,  116, 1752,  105,    0,    0],
[  23,    0,    0,   16,    1,   27,  314, 1614,    5,    0],
[  23,    0,    0,    5,   20,   22,    5,   20, 1905,    0],
[   0,   24,   35,    0,    0,    1,    1,    0,    0, 1939]]