Model: "sequential_21"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 Hidden_Layer_3 (Dense)      (None, 256)               1126656   
                                                                 
 dropout_34 (Dropout)        (None, 256)               0         
                                                                 
 Hidden_Layer_4 (Dense)      (None, 128)               32896     
                                                                 
 dropout_35 (Dropout)        (None, 128)               0         
                                                                 
 Output_Layer (Dense)        (None, 10)                1290      
                                                                 
=================================================================
Total params: 1160842 (4.43 MB)
Trainable params: 1160842 (4.43 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________


Test Accuracy: 93.63%

[[1989,    0,    0,    3,    2,    0,    2,    3,    1,    0],
[   0, 1977,   15,    0,    0,    0,    0,    0,    0,    8],
[   0,  118, 1879,    0,    0,    0,    0,    0,    0,    3],
[  24,    0,    1, 1914,   31,   23,    2,    4,    1,    0],
[  28,    0,    0,   42, 1892,   36,    1,    0,    1,    0],
[  19,    0,    0,   49,   45, 1837,   50,    0,    0,    0],
[  19,    0,    0,   11,    0,  106, 1760,  102,    2,    0],
[  26,    0,    0,   13,    1,   24,  298, 1633,    5,    0],
[  23,    0,    0,    5,   19,   18,    8,   18, 1909,    0],
[   0,   24,   38,    0,    0,    1,    1,    0,    0, 1936]]