Model: "sequential_17"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 Hidden_Layer_1 (Dense)      (None, 1024)              4506624   
                                                                 
 dropout_30 (Dropout)        (None, 1024)              0         
                                                                 
 Hidden_Layer_2 (Dense)      (None, 512)               524800    
                                                                 
 dropout_31 (Dropout)        (None, 512)               0         
                                                                 
 Hidden_Layer_3 (Dense)      (None, 256)               131328    
                                                                 
 dropout_32 (Dropout)        (None, 256)               0         
                                                                 
 Hidden_Layer_4 (Dense)      (None, 128)               32896     
                                                                 
 dropout_33 (Dropout)        (None, 128)               0         
                                                                 
 Output_Layer (Dense)        (None, 10)                1290      
                                                                 
=================================================================
Total params: 5196938 (19.82 MB)
Trainable params: 5196938 (19.82 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

Test Accuracy: 92.93%

[[1989,    0,    0,    2,    1,    0,    5,    2,    1,    0],
       [   1, 1984,    9,    0,    0,    0,    0,    0,    0,    6],
       [   0,  128, 1869,    0,    0,    0,    0,    0,    0,    3],
       [  29,    0,    2, 1871,   71,    9,    2,   15,    1,    0],
       [  27,    0,    0,   35, 1906,   28,    0,    0,    4,    0],
       [  19,    1,    0,   50,   62, 1819,   49,    0,    0,    0],
       [  17,    0,    0,    7,    3,  133, 1725,  114,    1,    0],
       [  27,    0,    0,   12,    3,   20,  344, 1584,   10,    0],
       [  26,    0,    0,    3,   17,   22,    8,   32, 1892,    0],
       [   0,   25,   28,    0,    0,    0,    0,    0,    0, 1947]]